20200502ClojureMadeSimple.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-10 Sun 14:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clojure, Made Simple</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Joe" />
</head>
<body>
<div id="content">
<h1 class="title">Clojure, Made Simple</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbb645c2">1. Java is not a productive language</a></li>
<li><a href="#orgb006fc3">2. Programming is an economic activity, it's for stakeholders, not programmers</a></li>
<li><a href="#orgd82c693">3. Stakeholders want Something Good - meaning what?</a>
<ul>
<li><a href="#orgac541ea">3.1. Something is good if it passes tests and type checks? NO</a></li>
<li><a href="#orgbca10f3">3.2. Something is good if it Does what it supposed to do - from the <i>stakeholders</i> perspective</a></li>
<li><a href="#org8215204">3.3. Something is good if it meets operations requirements (Clojure targets 'ease', i.e. familiarity to ops via browser / jvm)</a></li>
<li><a href="#orga5af278">3.4. Something is good if it's flexible enough to accomodate (inevitable) change - loose coupling!!</a></li>
<li><a href="#org01e69e6">3.5. Soon?</a></li>
</ul>
</li>
<li><a href="#orgfe7ef06">4. How does Clojure help you make something good? Data orientation and simplicity</a>
<ul>
<li><a href="#orgcaa5566">4.1. The benefits of data as a central concept - simplicity</a></li>
<li><a href="#org709c53d">4.2. Clojure embraces data - good data literals and collections, information is plain data</a>
<ul>
<li><a href="#orgea960b8">4.2.1. Collections are (and always should be) immutable</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org22bb370">5. The Clojure premise - get rid of OO busywork by using generic collections much much more.</a></li>
<li><a href="#org029dcb3">6. Objects are like marionettes - anyone can pull their strings</a></li>
<li><a href="#orgd551bd3">7. Objects are not how SYSTEMS (in the large) work - we've all agreed systems work with data - why should our programs (in the small) be different?</a></li>
<li><a href="#orge1043ba">8. Keep process and state boxed and separate with explicit state constructs</a>
<ul>
<li><a href="#org521f4fb">8.1. Why?</a></li>
</ul>
</li>
<li><a href="#orgd3a0b8c">9. Clojure leads to smaller program size: and small is better</a>
<ul>
<li><a href="#orgaafa7d9">9.1. Two types of small: concision and generality. Strive for generality</a></li>
<li><a href="#org4a3b6cf">9.2. Classes are the opposite of general when it comes to information.</a></li>
<li><a href="#orgd013d6d">9.3. Tiny benefits of class: dot completion! no typos! But everything else much worst</a></li>
<li><a href="#orga3a8299">9.4. The famous HttpServletRequest example</a></li>
<li><a href="#orgc33e031">9.5. JUST USE A MAP</a></li>
</ul>
</li>
<li><a href="#org055b93a">10. Dynamic Typing and code quality</a></li>
<li><a href="#org31435aa">11. Polymorphism</a></li>
</ul>
</div>
</div>
<p>
<a href="https://www.youtube.com/watch?v=VSdnJDO-xdg">https://www.youtube.com/watch?v=VSdnJDO-xdg</a>
</p>

<p>
Rich Hickey talk 2015 talk at a Java Conf.
</p>

<p>
This talk is about the data-orientation of clojure
</p>

<div id="outline-container-orgbb645c2" class="outline-2">
<h2 id="orgbb645c2"><span class="section-number-2">1</span> Java is not a productive language</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
"A lot of the best programmers and the most productive programmers I know are writing everythin in <span class="underline"><span class="underline"><span class="underline">_</span></span></span> and swearing by it, and then just producing ridiculously sophisticated things in a very short time. And that programmer productivity matters"
</p>
<ul class="org-ul">
<li>Adrian Cockcroft</li>
</ul>
</blockquote>

<p>
There's something about Java that makes it not suitable for the 'productivity' blank. What?
</p>
</div>
</div>

<div id="outline-container-orgb006fc3" class="outline-2">
<h2 id="orgb006fc3"><span class="section-number-2">2</span> Programming is an economic activity, it's for stakeholders, not programmers</h2>
<div class="outline-text-2" id="text-2">
<p>
Programmers are so <i>self focused</i> - no focus on cost/benefit, ROI, time to market.
</p>

<p>
Stakeholders want something good, soon
</p>
</div>
</div>

<div id="outline-container-orgd82c693" class="outline-2">
<h2 id="orgd82c693"><span class="section-number-2">3</span> Stakeholders want Something Good - meaning what?</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgac541ea" class="outline-3">
<h3 id="orgac541ea"><span class="section-number-3">3.1</span> Something is good if it passes tests and type checks? NO</h3>
<div class="outline-text-3" id="text-3-1">
<p>
These are programmer centric means not ends. They don't help the program do what it was supposed to do. Tests and type checks are only good in that they help with the next things.
</p>
</div>
</div>

<div id="outline-container-orgbca10f3" class="outline-3">
<h3 id="orgbca10f3"><span class="section-number-3">3.2</span> Something is good if it Does what it supposed to do - from the <i>stakeholders</i> perspective</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This is <b>hard to establish</b> if program is any one (or any combo of) the following: large, stateful, elaborate
</p>
</div>
</div>

<div id="outline-container-org8215204" class="outline-3">
<h3 id="org8215204"><span class="section-number-3">3.3</span> Something is good if it meets operations requirements (Clojure targets 'ease', i.e. familiarity to ops via browser / jvm)</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Deployable (clojure on the JVM)</li>
<li>security (clojure on the JVM)</li>
<li>Performance (clojure down there on the benchmark game (it is a game)</li>
</ul>
</div>
</div>

<div id="outline-container-orga5af278" class="outline-3">
<h3 id="orga5af278"><span class="section-number-3">3.4</span> Something is good if it's flexible enough to accomodate (inevitable) change - loose coupling!!</h3>
<div class="outline-text-3" id="text-3-4">
<p>
We keep talking about decoupling, and yet we keep complecting!
</p>
</div>
</div>

<div id="outline-container-org01e69e6" class="outline-3">
<h3 id="org01e69e6"><span class="section-number-3">3.5</span> Soon?</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Sometimes you want something NOW, will definitely throw it away. Clojure is not the best thing for that.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfe7ef06" class="outline-2">
<h2 id="orgfe7ef06"><span class="section-number-2">4</span> How does Clojure help you make something good? Data orientation and simplicity</h2>
<div class="outline-text-2" id="text-4">
<p>
(Simplicity as in the opposite of complexity, intertwined-ness)
</p>

<p>
What matters is what makes a language <b>practical</b> and <b>idiomatic</b> - data processing is what clojure does that for.
</p>
</div>

<div id="outline-container-orgcaa5566" class="outline-3">
<h3 id="orgcaa5566"><span class="section-number-3">4.1</span> The benefits of data as a central concept - simplicity</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Data processing is not a dirty word - acquire, xform, store, manage, transmit. It's the heart of any programming task. Programmers have a tendency to look down on it
</p>

<p>
There are cognitive benefits from thinking in data. Data/information is raw, immutable - SIMPLE. make your data structures reflect this and you have reflected the reality of data.
</p>

<p>
OO ruins this! It conflates process and information constructs. OO is terrible for information constructs (not so bad for process)
</p>
</div>
</div>

<div id="outline-container-org709c53d" class="outline-3">
<h3 id="org709c53d"><span class="section-number-3">4.2</span> Clojure embraces data - good data literals and collections, information is plain data</h3>
<div class="outline-text-3" id="text-4-2">
<p>
It's a lisp, so code <i>is</i> data. Homoiconicity
</p>

<p>
The vast majority of functions take data, return data. The language pressures you to make everything data.
</p>

<p>
There's the part of your program that isn't data - the plumbing stuff, active parts of program, the part of your program that is more like a machine than information - that's the other part. But it's small - mostly it's transforming data.
</p>

<p>
Clojure has a small number of primatives, including symbols, keywords (enum like), regex patterns.
</p>

<p>
Clojure has a few data structures - lists, vecs, (hash)maps, sets. They are <b>nesting</b> and <b>immutable</b>. 
</p>

<p>
Maps are very effective and efficient! In the small, you can use them as 'object'/struct like things, or in the large as 'data processing' like things
</p>
</div>

<div id="outline-container-orgea960b8" class="outline-4">
<h4 id="orgea960b8"><span class="section-number-4">4.2.1</span> Collections are (and always should be) immutable</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
You can't change primatives (42) you can't change a list of primatives [1 2 42]. Both are values, with no implicit concept of an 'identity' that changes over time. The concepts are separate. Just make a new one. Persistent data structures, structural-sharing under the hood.
</p>

<p>
This conflation of value and identity is the giant problem with objects.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org22bb370" class="outline-2">
<h2 id="org22bb370"><span class="section-number-2">5</span> The Clojure premise - get rid of OO busywork by using generic collections much much more.</h2>
<div class="outline-text-2" id="text-5">
<p>
OO has SO MUCH BUSY WORK! Just build systems out of that much much simpler stuff, those data structures and pure functions.
</p>

<p>
You still need IO/state/side-effects - put them at the edges. Runtime polymorphism is nice too
</p>

<p>
Clojure makes it idiomatic. Replaces ALL the things you can do in C++, Java - makes it much much easier
</p>
</div>
</div>

<div id="outline-container-org029dcb3" class="outline-2">
<h2 id="org029dcb3"><span class="section-number-2">6</span> Objects are like marionettes - anyone can pull their strings</h2>
<div class="outline-text-2" id="text-6">
<p>
Anyone who has access can pull its strings, whenever they want. You have as many 'masterminders' as things that have been given a reference to the object.
</p>

<p>
It Just Doesn't Work! Class writers have to try to defend against it, and you just can't, really.
</p>

<p>
You can use Value objects? Sure, but it's not idiomatic, it's hard. It can also be implicit, unguaranteed. If you have a reference to an object, you have NO guarantee that the marionette won't start dancing on you
</p>

<p>
And there's the object as a contruct for distribution - remote object calls are (we all know this) awful. Never put an object on the wire. RMI/DCOM/CORBA - don't do it
</p>

<p>
You have no control, your OO language gives you no control.
</p>

<p>
So stuff is on the wire: Now you have to MAP/translate back to your Object. How? ORM. ORM is a nightmare. It that a problem with a relational data mode? With SQL? NO, it's problem with OBJECTS
</p>
</div>
</div>

<div id="outline-container-orgd551bd3" class="outline-2">
<h2 id="orgd551bd3"><span class="section-number-2">7</span> Objects are not how SYSTEMS (in the large) work - we've all agreed systems work with data - why should our programs (in the small) be different?</h2>
<div class="outline-text-2" id="text-7">
<p>
System - to cause to stand. Legs on a stool. Independent parts connected
</p>

<p>
We <i>do</i> try to build systems independently.  We don't want to care that that other program on another servers is written in another language. We don't want to have to co-ordinate everything.
</p>

<p>
After trying out objects as the basis for system communication we've agreed it doesn't work, and we should just use data. We do Remote Procedure Call (RPC) using plain data, or we use queues, also with data.
</p>

<p>
Using data as the central idea for systems provides flexibility: it supports independent development. They are tolerant in what they accept. Think of the web: Chrome doesn't need to change when Twitter changes their homepage. They can accept data they're not expecting to see, won't fall over
</p>

<p>
<b><i>Do that for the inside of systems as well as the outside</i></b> - no real change in concepts is necessary, we already have the ideas inside our languages:
</p>
<ul class="org-ul">
<li>RPC =&gt; PC (function calls)</li>
<li>queues =&gt; channels</li>
</ul>
</div>
</div>

<div id="outline-container-orge1043ba" class="outline-2">
<h2 id="orge1043ba"><span class="section-number-2">8</span> Keep process and state boxed and separate with explicit state constructs</h2>
<div class="outline-text-2" id="text-8">
<p>
What about Process and state? There WILL be process and state, and they are inherently complecting - how to deal with them? Clojure has explicit state constructs.
</p>

<p>
In typical OO you have types, but really nothing that helps you with this - only very raw constructs like mutexes.
</p>

<p>
(Some very pure languages will force you very hard to isolate state/side effects. Clojure isn't one of them - it favours the idiom over the hard rule here)
</p>

<p>
Clojure state constructs have explicit semantics for state transforms. You can also deref and get the (immutable) value. CAS (compare and swap) is a type of this that can use this construct. STM is another, bigger and more transactional
</p>
</div>

<div id="outline-container-org521f4fb" class="outline-3">
<h3 id="org521f4fb"><span class="section-number-3">8.1</span> Why?</h3>
<div class="outline-text-3" id="text-8-1">
<p>
It's explicit - calls out where it is. It's like a big warning sign. If you don't have that you have to do it yourself!
</p>

<p>
core.async - queue implementation. conveyer belt vs. variable: Flow vs. Place
</p>
</div>
</div>
</div>

<div id="outline-container-orgd3a0b8c" class="outline-2">
<h2 id="orgd3a0b8c"><span class="section-number-2">9</span> Clojure leads to smaller program size: and small is better</h2>
<div class="outline-text-2" id="text-9">
<p>
We have research on this! Smaller programs have fewer bugs, quicker to market, less maintainance, less brittle
</p>
</div>

<div id="outline-container-orgaafa7d9" class="outline-3">
<h3 id="orgaafa7d9"><span class="section-number-3">9.1</span> Two types of small: concision and generality. Strive for generality</h3>
<div class="outline-text-3" id="text-9-1">
<p>
There are Two types of small: concision (size in the small) and generality (size in the large). Generality, allowing your code to be used in general, is where the big gains are (&gt;2x) are, vs 'how many LOC is your if statement'.
</p>
</div>
</div>

<div id="outline-container-org4a3b6cf" class="outline-3">
<h3 id="org4a3b6cf"><span class="section-number-3">9.2</span> Classes are the opposite of general when it comes to information.</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Most information objects are just maps of name-&gt;value. But you have to write a class every time! And you can't even use it like a map. More code, less reuse, more coupling
</p>

<p>
A class has it's own DSL that you have to relearn, and can never reuse. Sure you can get the cognitive benefit from the abstraction (if you do it well) - but the costs are huge.
</p>
</div>
</div>

<div id="outline-container-orgd013d6d" class="outline-3">
<h3 id="orgd013d6d"><span class="section-number-3">9.3</span> Tiny benefits of class: dot completion! no typos! But everything else much worst</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>big interface, internally inconsistent, idiosyncratic</li>
<li>MUCH more code</li>
<li>can't reuse generic map libs</li>
<li>client code completely coupled</li>
<li>harder to test</li>
</ul>
</div>
</div>

<div id="outline-container-orga3a8299" class="outline-3">
<h3 id="orga3a8299"><span class="section-number-3">9.4</span> The famous HttpServletRequest example</h3>
<div class="outline-text-3" id="text-9-4">
<p>
The Java HttpServletRequest has ~50 methods. How many embedded maps? It's actually hard to tell. Maybe 4. They're all different, and all used differently
</p>

<p>
<b>AN HTTP REQUEST WAS JUST DATA - HOW DID WE SCREW THAT UP!?!</b>
</p>
</div>
</div>

<div id="outline-container-orgc33e031" class="outline-3">
<h3 id="orgc33e031"><span class="section-number-3">9.5</span> JUST USE A MAP</h3>
<div class="outline-text-3" id="text-9-5">
<p>
You can just see it, see all the submaps, it's right there in front of you. And it's so general: HttpServletRequest is explicitly tied to the authors model of a request.
</p>
</div>
</div>
</div>

<div id="outline-container-org055b93a" class="outline-2">
<h2 id="org055b93a"><span class="section-number-2">10</span> Dynamic Typing and code quality</h2>
<div class="outline-text-2" id="text-10">
<p>
What does a (Java) type checker catch? Typos, basically. It's pretty trivial to just catch them in tests. Checking type is not enough to guarantee quality!
</p>

<p>
Quality measures are all in state management, coupling, comprehension (<i>misconception</i> is the 10x cause of problems), lack of flexibility. Type systems encourage / contributes to all of those things
</p>
</div>
</div>

<div id="outline-container-org31435aa" class="outline-2">
<h2 id="org31435aa"><span class="section-number-2">11</span> Polymorphism</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Independent - procotols are interfaces that don't require inheritance</li>
<li>can be extended to existing / closed classes</li>
<li>a la carte - reduces coupling</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joe</p>
<p class="date">Created: 2020-05-10 Sun 14:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
